r-downing/edx-rtos-course-data-msp432/inc/BSPnotMKII.c
// ------------BSP_Button1_Init------------
// Initialize a GPIO pin for input, which corresponds
// with BoosterPack pin J4.33.
// Input: none
// Output: none
void BSP_Button1_Init(void){
  P1SEL0 &= ~0x02;
  P1SEL1 &= ~0x02;                 // configure P1.1 as GPIO
  P1DIR &= ~0x02;                  // make P1.1 in
  P1REN |= 0x02;                   // enable pull resistor on P1.1
  P1OUT |= 0x02;                   // P1.1 is pull-up
}

// ------------BSP_Button1_Input------------
// Read and return the immediate status of Button1.
// Button de-bouncing is not considered.
// Input: none
// Output: non-zero if Button1 unpressed
//         zero if Button1 pressed
// Assumes: BSP_Button1_Init() has been called
#define BUTTON1   (*((volatile uint8_t *)(0x42000000+32*0x4C00+4*1)))  /* Port 1.1 Input */
uint8_t BSP_Button1_Input(void){
  return BUTTON1;                  // return 0(pressed) or 0x01(not pressed)
}

// ------------BSP_Button2_Init------------
// Initialize a GPIO pin for input, which corresponds
// with BoosterPack pin J4.32.
// Input: none
// Output: none
void BSP_Button2_Init(void){
  P1SEL0 &= ~0x10;
  P1SEL1 &= ~0x10;                 // configure P1.4 as GPIO
  P1DIR &= ~0x10;                  // make P1.4 in
  P1REN |= 0x10;                   // enable pull resistor on P1.4
  P1OUT |= 0x10;                   // P1.4 is pull-up
}

// ------------BSP_Button2_Input------------
// Read and return the immediate status of Button2.
// Button de-bouncing is not considered.
// Input: none
// Output: non-zero if Button2 unpressed
//         zero if Button2 pressed
// Assumes: BSP_Button2_Init() has been called
#define BUTTON2   (*((volatile uint8_t *)(0x42000000+32*0x4C00+4*4)))  /* Port 1.4 Input */
uint8_t BSP_Button2_Input(void){
  return BUTTON2;                  // return 0(pressed) or 0x01(not pressed)
}

// There are six analog inputs on the Educational BoosterPack MKII:
// microphone (J1.6/P4.3/A10)
// joystick X (J1.2/P6.0/A15) and Y (J3.26/P4.4/A9)
// accelerometer X (J3.23/P6.1/A14), Y (J3.24/P4.0/A13), and Z (J3.25/P4.2/A11)
// All six initialization functions can use this general ADC
// initialization.  The joystick uses sequence starting at 0,
// the accelerometer uses sequence starting at 2, and the
// microphone uses sequence starting at 5.
void static adcinit(void){
/*reference not used--analog peripherals are 0 to 3.3V
  while(REFCTL0&0x0400){};         // wait for the reference to be idle before reconfiguring (see REF4 in errata)
  // 15-14 reserved                          00b (reserved)
  // 13    REFBGRDY   bandgap voltage ready   0b (read only)
  // 12    REFGENRDY  reference voltage ready 0b (read only)
  // 11    BGMODE     bandgap mode            0b (read only)
  // 10    REFGENBUSY no reconfigure if busy  0b (read only)
  // 9     REFBGACT   bandgap active          0b (read only)
  // 8     REFGENACT  reference active        0b (read only)
  // 7     REFBGOT    trigger bandgap         0b = no software trigger set
  // 6     REFGENOT   trigger reference       0b = no software trigger set
  // 5-4   REFVSEL    voltage level select   11b = 2.5V
  // 3     REFTCOFF   temperature disable     1b = temperature sensor disabled to save power
  // 2     reserved                           0b (reserved)
  // 1     REFOUT     reference output buffer 0b = reference output not on P5.6 (see also REFBURST in ADC14CTL1, P5SEL1, and P5SEL0)
  // 0     REFON      reference enable        1b = reference enabled in static mode
  REFCTL0 = 0x0039;                // 1) configure reference for static 2.5V
  while((REFCTL0&0x1000) == 0){};  // wait for the reference to stabilize before continuing (optional, see REF8 in errata)
*/
  ADC14CTL0 &= ~0x00000002;        // 2) ADC14ENC = 0 to allow programming
  while(ADC14CTL0&0x00010000){};   // 3) wait for BUSY to be zero
  // 31-30 ADC14PDIV  predivider,            00b = Predivide by 1
  // 29-27 ADC14SHSx  SHM source            000b = ADC14SC bit
  // 26    ADC14SHP   SHM pulse-mode          1b = SAMPCON the sampling timer
  // 25    ADC14ISSH  invert sample-and-hold  0b = not inverted
  // 24-22 ADC14DIVx  clock divider         000b = /1
  // 21-19 ADC14SSELx clock source select   100b = SMCLK
  // 18-17 ADC14CONSEQx mode select          01b = Sequence-of-channels
  // 16    ADC14BUSY  ADC14 busy              0b (read only)
  // 15-12 ADC14SHT1x sample-and-hold time 0011b = 32 clocks
  // 11-8  ADC14SHT0x sample-and-hold time 0011b = 32 clocks
  // 7     ADC14MSC   multiple sample         1b = continue conversions automatically after first SHI signal trigger
  // 6-5   reserved                          00b (reserved)
  // 4     ADC14ON    ADC14 on                1b = powered up
  // 3-2   reserved                          00b (reserved)
  // 1     ADC14ENC   enable conversion       0b = ADC14 disabled
  // 0     ADC14SC    ADC14 start             0b = No start (yet)
  ADC14CTL0 = 0x04223390;          // 4) single, SMCLK, on, disabled, /1, 32 SHM
  // 20-16 STARTADDx  start addr          00000b = ADC14MEM0
  // 15-6  reserved                  0000000000b (reserved)
  // 5-4   ADC14RES   ADC14 resolution       11b = 14 bit, 16 clocks
  // 3     ADC14DF    data read-back format   0b = Binary unsigned
  // 2     REFBURST   reference buffer burst  0b = reference on continuously
  // 1-0   ADC14PWRMD ADC power modes        00b = Regular power mode
  ADC14CTL1 = 0x00000030;          // 5) ADC14MEM0, 14-bit, ref on, regular power
                                   // 6) different for each initialization function
  ADC14IER0 = 0;
  ADC14IER1 = 0;                   // 7) no interrupts
}

// ------------BSP_Joystick_Init------------
// Initialize a GPIO pin for input, which corresponds
// with BoosterPack pin J1.5 (Select button).
// Initialize two ADC pins, which correspond with
// BoosterPack pins J1.2 (X) and J3.26 (Y).
// Input: none
// Output: none
void BSP_Joystick_Init(void){
  adcinit();
  // 15   ADC14WINCTH Window comp threshold   0b = not used
  // 14   ADC14WINC   Comparator enable       0b = Comparator disabled
  // 13   ADC14DIF    Differential mode       0b = Single-ended mode enabled
  // 12   reserved                            0b (reserved)
  // 11-8 ADC14VRSEL  V(R+) and V(R-)      0000b = V(R+) = AVCC, V(R-) = AVSS
  // 7    ADC14EOS    End of sequence         0b = Not end of sequence
  // 6-5  reserved                           00b (reserved)
  // 4-0  ADC14INCHx  Input channel       01111b = A15, P6.0
  ADC14MCTL0 = 0x0000000F;         // 6a) 0 to 3.3V, channel 15
  // 15   ADC14WINCTH Window comp threshold   0b = not used
  // 14   ADC14WINC   Comparator enable       0b = Comparator disabled
  // 13   ADC14DIF    Differential mode       0b = Single-ended mode enabled
  // 12   reserved                            0b (reserved)
  // 11-8 ADC14VRSEL  V(R+) and V(R-)      0000b = V(R+) = AVCC, V(R-) = AVSS
  // 7    ADC14EOS    End of sequence         1b = End of sequence
  // 6-5  reserved                           00b (reserved)
  // 4-0  ADC14INCHx  Input channel       01001b = A9, P4.4
  ADC14MCTL1 = 0x00000089;         // 6b) 0 to 3.3V, channel 9
  P6SEL0 |= 0x01;
  P6SEL1 |= 0x01;                  // 8a) analog mode on P6.0/A15
  P4SEL0 |= 0x10;
  P4SEL1 |= 0x10;                  // 8b) analog mode on P4.4/A9
  ADC14CTL0 |= 0x00000002;         // 9) enable
  P4SEL0 &= ~0x02;
  P4SEL1 &= ~0x02;                 // configure P4.1 as GPIO
  P4DIR &= ~0x02;                  // make P4.1 in
  P4REN &= ~0x02;                  // disable pull resistor on P4.1
}

// ------------BSP_Joystick_Input------------
// Read and return the immediate status of the
// joystick.  Button de-bouncing for the Select
// button is not considered.  The joystick X- and
// Y-positions are returned as 10-bit numbers,
// even if the ADC on the LaunchPad is more precise.
// Input: x is pointer to store X-position (0 to 1023)
//        y is pointer to store Y-position (0 to 1023)
//        select is pointer to store Select status (0 if pressed)
// Output: none
// Assumes: BSP_Joystick_Init() has been called
#define SELECT    (*((volatile uint8_t *)(0x42000000+32*0x4C21+4*1)))  /* Port 4.1 Input */
void BSP_Joystick_Input(uint16_t *x, uint16_t *y, uint8_t *select){
  ADC14CTL0 &= ~0x00000002;        // 1) ADC14ENC = 0 to allow programming
  while(ADC14CTL0&0x00010000){};   // 2) wait for BUSY to be zero
  ADC14CTL1 = (ADC14CTL1&~0x001F0000) | // clear STARTADDx bit field
              (0 << 16);           // 3) configure for STARTADDx = 0
  ADC14CTL0 |= 0x00000002;         // 4) enable conversions
  while(ADC14CTL0&0x00010000){};   // 5) wait for BUSY to be zero
  ADC14CTL0 |= 0x00000001;         // 6) start single conversion
  while((ADC14IFGR0&0x02) == 0){}; // 7) wait for ADC14IFG1
  *x = ADC14MEM0>>4;               // 8) P6.0/A15 result 0 to 1023
  *y = ADC14MEM1>>4;               //    P4.4/A9 result 0 to 1023
  *select = SELECT;                // return 0(pressed) or 0x01(not pressed)
}

// ------------BSP_RGB_Init------------
// Initialize the GPIO and PWM or timer modules which
// correspond with BoosterPack pins J4.39 (red),
// J4.38 (green), and J4.37 (blue).  The frequency
// must be fast enough to not appear to flicker, and
// the duty cycle is represented as a 10-bit number.
// 1023 is fully (or nearly fully) on.
// 0 is fully (or nearly fully) off.
// Input: red is 10-bit duty cycle for red
//        green is 10-bit duty cycle for green
//        blue is 10-bit duty cycle for blue
// Output: none
static uint16_t PWMCycles;         // number of PWM cycles per period
void BSP_RGB_Init(uint16_t red, uint16_t green, uint16_t blue){
  if((red > 1023) || (green > 1023) || (blue > 1023)){
    return;                        // invalid input
  }
  // ***************** Port Mapping initialization *****************
  PMAPKEYID = 0x2D52;              // unlock Port Mapping Controller
  PMAPCTL |= 0x0002;               // allow reconfiguration of port mapping
                                   // configure P2.0 for TA0.3
                                   // configure P2.1 for TA0.1
  P2MAP01 = (PM_TA0CCR1A<<8)|PM_TA0CCR3A;
                                   // configure P2.2 for TA0.2
  P2MAP23 = (P2MAP23&~0x00FF)|PM_TA0CCR2A;
  PMAPKEYID = 0;                   // lock Port Mapping Controller
  // ***************** Timer A0 initialization *****************
  // RGB LED green connected to P2.1 on MSP432 LaunchPad, which is mapped to TA0.1
  // RGB LED blue connected to P2.2 on MSP432 LaunchPad, which is mapped to TA0.2
  // RGB LED red connected to P2.0 on MSP432 LaunchPad, which is mapped to TA0.3
  TA0CTL &= ~0x0030;               // halt Timer A0
  // bits15-10=XXXXXX, reserved
  // bits9-8=10,       clock source to SMCLK
  // bits7-6=00,       input clock divider /1
  // bits5-4=00,       stop mode
  // bit3=X,           reserved
  // bit2=0,           set this bit to clear
  // bit1=0,           interrupt disable
  // bit0=0,           clear interrupt pending
  TA0CTL = 0x0200;
  // bits15-14=00,     no capture mode
  // bits13-12=XX,     capture/compare input select
  // bit11=X,          synchronize capture source
  // bit10=X,          synchronized capture/compare input
  // bit9=X,           reserved
  // bit8=0,           compare mode
  // bits7-5=111,      reset/set output mode
  // bit4=0,           disable capture/compare interrupt
  // bit3=X,           read capture/compare input from here
  // bit2=X,           output this value in output mode 0
  // bit1=X,           capture overflow status
  // bit0=0,           clear capture/compare interrupt pending
  TA0CCTL1 = 0x00E0;
  PWMCycles = SubsystemFrequency/2048;
  TA0CCR1 = (green*PWMCycles)>>10; // defines when output signal is cleared
  // bits15-14=00,     no capture mode
  // bits13-12=XX,     capture/compare input select
  // bit11=X,          synchronize capture source
  // bit10=X,          synchronized capture/compare input
  // bit9=X,           reserved
  // bit8=0,           compare mode
  // bits7-5=111,      reset/set output mode
  // bit4=0,           disable capture/compare interrupt
  // bit3=X,           read capture/compare input from here
  // bit2=X,           output this value in output mode 0
  // bit1=X,           capture overflow status
  // bit0=0,           clear capture/compare interrupt pending
  TA0CCTL2 = 0x00E0;
  TA0CCR2 = (blue*PWMCycles)>>10; // defines when output signal is cleared
  // bits15-14=00,     no capture mode
  // bits13-12=XX,     capture/compare input select
  // bit11=X,          synchronize capture source
  // bit10=X,          synchronized capture/compare input
  // bit9=X,           reserved
  // bit8=0,           compare mode
  // bits7-5=111,      reset/set output mode
  // bit4=0,           disable capture/compare interrupt
  // bit3=X,           read capture/compare input from here
  // bit2=X,           output this value in output mode 0
  // bit1=X,           capture overflow status
  // bit0=0,           clear capture/compare interrupt pending
  TA0CCTL3 = 0x00E0;
  TA0CCR3 = (red*PWMCycles)>>10;   // defines when output signal is cleared
  TA0CCR0 = PWMCycles - 1;         // defines when output signals are set
  TA0EX0 &= ~0x0007;               // configure for input clock divider /1
  TA0CTL |= 0x0014;                // reset and start Timer A0 in up mode
  // ***************** GPIO initialization *****************
  P2SEL0 |= 0x07;
  P2SEL1 &= ~0x07;                 // configure P2.2-P2.0 as timer out
  P2DIR |= 0x07;                   // make P2.2-P2.0 out
  P2DS |= 0x07;                    // enable high drive strength on P2.2-P2.0
}

// ------------BSP_RGB_Set------------
// Set new duty cycles for the RGB LEDs.
// 1023 is fully (or nearly fully) on.
// 0 is fully (or nearly fully) off.
// Input: red is 10-bit duty cycle for red
//        green is 10-bit duty cycle for green
//        blue is 10-bit duty cycle for blue
// Output: none
// Assumes: BSP_RGB_Init() has been called
void BSP_RGB_Set(uint16_t red, uint16_t green, uint16_t blue){
  if((red > 1023) || (green > 1023) || (blue > 1023)){
    return;                        // invalid input
  }
  TA0CCR3 = (red*PWMCycles)>>10;   // defines when output signal is cleared
  TA0CCR1 = (green*PWMCycles)>>10; // defines when output signal is cleared
  TA0CCR2 = (blue*PWMCycles)>>10;  // defines when output signal is cleared
}

// ------------BSP_RGB_D_Init------------
// Initialize the GPIO pins for output which
// correspond with BoosterPack pins J4.39 (red),
// J4.38 (green), and J4.37 (blue).  Instead of using
// PWM or timer modules, this configuration uses just
// digital fully on or fully off.
// non-zero is fully on.
// 0 is fully off.
// Input: red is initial status for red
//        green is initial status for green
//        blue is initial status for blue
// Output: none
#define RED       (*((volatile uint8_t *)(0x42000000+32*0x4C03+4*0)))  /* Port 2.0 Output */
#define GREEN     (*((volatile uint8_t *)(0x42000000+32*0x4C03+4*1)))  /* Port 2.1 Output */
#define BLUE      (*((volatile uint8_t *)(0x42000000+32*0x4C03+4*2)))  /* Port 2.2 Output */
void BSP_RGB_D_Init(int red, int green, int blue){
  if(red){
    RED = 0x01;
  } else{
    RED = 0x00;
  }
  if(green){
    GREEN = 0x01;
  } else{
    GREEN = 0x00;
  }
  if(blue){
    BLUE = 0x01;
  } else{
    BLUE = 0x00;
  }
  P2SEL0 &= ~0x07;
  P2SEL1 &= ~0x07;                 // configure P2.2-P2.0 as GPIO
  P2DIR |= 0x07;                   // make P2.2-P2.0 out
  P2DS |= 0x07;                    // enable high drive strength on P2.2-P2.0
}

// ------------BSP_RGB_D_Set------------
// Set new statuses for the RGB LEDs.
// non-zero is fully on.
// 0 is fully off.
// Input: red is status for red
//        green is status for green
//        blue is status for blue
// Output: none
// Assumes: BSP_RGB_D_Init() has been called
void BSP_RGB_D_Set(int red, int green, int blue){
  if(red){
    RED = 0x01;
  } else{
    RED = 0x00;
  }
  if(green){
    GREEN = 0x01;
  } else{
    GREEN = 0x00;
  }
  if(blue){
    BLUE = 0x01;
  } else{
    BLUE = 0x00;
  }
}

// ------------BSP_RGB_D_Toggle------------
// Toggle the statuses of the RGB LEDs.
// non-zero is toggle.
// 0 is do not toggle.
// Input: red is toggle for red
//        green is toggle for green
//        blue is toggle for blue
// Output: none
// Assumes: BSP_RGB_D_Init() has been called
void BSP_RGB_D_Toggle(int red, int green, int blue){
  if(red){
    RED = RED^0x01;
  }
  if(green){
    GREEN = GREEN^0x01;
  }
  if(blue){
    BLUE = BLUE^0x01;
  }
}

// ------------BSP_Buzzer_Init------------
// Initialize the GPIO and PWM or timer modules which
// correspond with BoosterPack pin J4.40.  The
// frequency is 2048 Hz, and the duty cycle is
// represented as a 10-bit number.
// Input: duty is 10-bit duty cycle for the buzzer
// Output: none
void BSP_Buzzer_Init(uint16_t duty){
  if(duty > 1023){
    return;                        // invalid input
  }
  // ***************** Timer A0 initialization *****************
  // buzzer connected to J4.40 (PWM), which is P2.7/TA0.4 on MSP432 LaunchPad
  TA0CTL &= ~0x0030;               // halt Timer A0
  // bits15-10=XXXXXX, reserved
  // bits9-8=10,       clock source to SMCLK
  // bits7-6=00,       input clock divider /1
  // bits5-4=00,       stop mode
  // bit3=X,           reserved
  // bit2=0,           set this bit to clear
  // bit1=0,           interrupt disable
  // bit0=0,           clear interrupt pending
  TA0CTL = 0x0200;
  // bits15-14=00,     no capture mode
  // bits13-12=XX,     capture/compare input select
  // bit11=X,          synchronize capture source
  // bit10=X,          synchronized capture/compare input
  // bit9=X,           reserved
  // bit8=0,           compare mode
  // bits7-5=111,      reset/set output mode
  // bit4=0,           disable capture/compare interrupt
  // bit3=X,           read capture/compare input from here
  // bit2=X,           output this value in output mode 0
  // bit1=X,           capture overflow status
  // bit0=0,           clear capture/compare interrupt pending
  TA0CCTL4 = 0x00E0;
  PWMCycles = SubsystemFrequency/2048;
  TA0CCR4 = (duty*PWMCycles)>>10;  // defines when output signal is cleared
  TA0CCR0 = PWMCycles - 1;         // defines when output signals are set
  TA0EX0 &= ~0x0007;               // configure for input clock divider /1
  TA0CTL |= 0x0014;                // reset and start Timer A0 in up mode
  // ***************** GPIO initialization *****************
  P2SEL0 |= 0x80;
  P2SEL1 &= ~0x80;                 // configure P2.7 as timer out
  P2DIR |= 0x80;                   // make P2.7 out
}

// ------------BSP_Buzzer_Set------------
// Set new duty cycle for the buzzer.
// 512 is typical for sound (50% duty cycle).
// 0 is typical for silent (0% duty cycle).
// Input: duty is 10-bit duty cycle for the buzzer
// Output: none
// Assumes: BSP_Buzzer_Init() has been called
void BSP_Buzzer_Set(uint16_t duty){
  if(duty > 1023){
    return;                        // invalid input
  }
  TA0CCR4 = (duty*PWMCycles)>>10;  // defines when output signal is cleared
}

// ------------BSP_Accelerometer_Init------------
// Initialize three ADC pins, which correspond with
// BoosterPack pins J3.23 (X), J3.24 (Y), and
// J3.25 (Y).
// Input: none
// Output: none
void BSP_Accelerometer_Init(void){
  adcinit();
  // 15   ADC14WINCTH Window comp threshold   0b = not used
  // 14   ADC14WINC   Comparator enable       0b = Comparator disabled
  // 13   ADC14DIF    Differential mode       0b = Single-ended mode enabled
  // 12   reserved                            0b (reserved)
  // 11-8 ADC14VRSEL  V(R+) and V(R-)      0000b = V(R+) = AVCC, V(R-) = AVSS
  // 7    ADC14EOS    End of sequence         0b = Not end of sequence
  // 6-5  reserved                           00b (reserved)
  // 4-0  ADC14INCHx  Input channel       01110b = A14, P6.1
  ADC14MCTL2 = 0x0000000E;         // 6a) 0 to 3.3V, channel 14
  // 15   ADC14WINCTH Window comp threshold   0b = not used
  // 14   ADC14WINC   Comparator enable       0b = Comparator disabled
  // 13   ADC14DIF    Differential mode       0b = Single-ended mode enabled
  // 12   reserved                            0b (reserved)
  // 11-8 ADC14VRSEL  V(R+) and V(R-)      0000b = V(R+) = AVCC, V(R-) = AVSS
  // 7    ADC14EOS    End of sequence         0b = not end of sequence
  // 6-5  reserved                           00b (reserved)
  // 4-0  ADC14INCHx  Input channel       01101b = A13, P4.0
  ADC14MCTL3 = 0x0000000D;         // 6b) 0 to 3.3V, channel 13
  // 15   ADC14WINCTH Window comp threshold   0b = not used
  // 14   ADC14WINC   Comparator enable       0b = Comparator disabled
  // 13   ADC14DIF    Differential mode       0b = Single-ended mode enabled
  // 12   reserved                            0b (reserved)
  // 11-8 ADC14VRSEL  V(R+) and V(R-)      0000b = V(R+) = AVCC, V(R-) = AVSS
  // 7    ADC14EOS    End of sequence         1b = End of sequence
  // 6-5  reserved                           00b (reserved)
  // 4-0  ADC14INCHx  Input channel       01011b = A11, P4.2
  ADC14MCTL4 = 0x0000008B;         // 6c) 0 to 3.3V, channel 11
  P6SEL0 |= 0x02;
  P6SEL1 |= 0x02;                  // 8a) analog mode on P6.1/A14
  P4SEL0 |= 0x05;
  P4SEL1 |= 0x05;                  // 8bc) analog mode on P4.2/A11 and P4.0/A13
  ADC14CTL0 |= 0x00000002;         // 9) enable
}

// ------------BSP_Accelerometer_Input------------
// Read and return the immediate status of the
// accelerometer.  The accelerometer X-, Y-, and
// Z-measurements are returned as 10-bit numbers,
// even if the ADC on the LaunchPad is more precise.
// Input: x is pointer to store X-measurement (0 to 1023)
//        y is pointer to store Y-measurement (0 to 1023)
//        z is pointer to store Z-measurement (0 to 1023)
// Output: none
// Assumes: BSP_Accelerometer_Init() has been called
void BSP_Accelerometer_Input(uint16_t *x, uint16_t *y, uint16_t *z){
  ADC14CTL0 &= ~0x00000002;        // 1) ADC14ENC = 0 to allow programming
  while(ADC14CTL0&0x00010000){};   // 2) wait for BUSY to be zero
  ADC14CTL1 = (ADC14CTL1&~0x001F0000) | // clear STARTADDx bit field
              (2 << 16);           // 3) configure for STARTADDx = 2
  ADC14CTL0 |= 0x00000002;         // 4) enable conversions
  while(ADC14CTL0&0x00010000){};   // 5) wait for BUSY to be zero
  ADC14CTL0 |= 0x00000001;         // 6) start single conversion
  while((ADC14IFGR0&0x10) == 0){}; // 7) wait for ADC14IFG4
  *x = ADC14MEM2>>4;               // 8) P6.1/A14 result 0 to 1023
  *y = ADC14MEM3>>4;               //    P4.0/A13 result 0 to 1023
  *z = ADC14MEM4>>4;               //    P4.2/A11 result 0 to 1023
}

// ------------BSP_Microphone_Init------------
// Initialize one ADC pin, which corresponds with
// BoosterPack pin J1.6.
// Input: none
// Output: none
void BSP_Microphone_Init(void){
  adcinit();
  // 15   ADC14WINCTH Window comp threshold   0b = not used
  // 14   ADC14WINC   Comparator enable       0b = Comparator disabled
  // 13   ADC14DIF    Differential mode       0b = Single-ended mode enabled
  // 12   reserved                            0b (reserved)
  // 11-8 ADC14VRSEL  V(R+) and V(R-)      0000b = V(R+) = AVCC, V(R-) = AVSS
  // 7    ADC14EOS    End of sequence         1b = End of sequence
  // 6-5  reserved                           00b (reserved)
  // 4-0  ADC14INCHx  Input channel       01010b = A10, P4.3
  ADC14MCTL5 = 0x0000008A;         // 6) 0 to 3.3V, channel 10
  P4SEL0 |= 0x08;
  P4SEL1 |= 0x08;                  // 8) analog mode on P4.3/A10
  ADC14CTL0 |= 0x00000002;         // 9) enable
}

