r-downing/edx-rtos-course-data-msp432/inc/BSPnotMKII.c
// Send the appropriate codes to initiate a
// measurement with an OPT3001 light sensor at I2C
// slave address 'slaveAddress'.
// Assumes: BSP_LightSensor_Init() has been called
/*void static lightsensorstart(uint8_t slaveAddress){
  // configure Low Limit Register (0x02) for:
  // INT pin active after each conversion completes
  I2C_Send3(slaveAddress, 0x02, 0xC0, 0x00);
  // configure Configuration Register (0x01) for:
  // 15-12 RN         range number         1100b = automatic full-scale setting mode
  // 11    CT         conversion time         1b = 800 ms
  // 10-9  M          mode of conversion     01b = single-shot
  // 8     OVF        overflow flag field     0b (read only)
  // 7     CRF        conversion ready field  0b (read only)
  // 6     FH         flag high field         0b (read only)
  // 5     FL         flag low field          0b (read only)
  // 4     L          latch                   1b = latch interrupt if measurement exceeds programmed ranges
  // 3     POL        polarity                0b = INT pin reports active low
  // 2     ME         mask exponent           0b = do not mask exponent (more math later)
  // 1-0   FC         fault count            00b = 1 fault triggers interrupt
  I2C_Send3(slaveAddress, 0x01, 0xCA, 0x10);
  I2C_Recv2(slaveAddress);         // read Configuration Register to reset conversion ready
}*/

// Send the appropriate codes to end a measurement
// with an OPT3001 light sensor at I2C slave address
// 'slaveAddress'.  Return results (units 100*lux).
// Assumes: BSP_LightSensor_Init() has been called and measurement is ready
/*int32_t static lightsensorend(uint8_t slaveAddress){
  uint16_t raw, config;
  I2C_Send1(slaveAddress, 0x00);   // pointer register 0x00 = Result Register
  raw = I2C_Recv2(slaveAddress);
  // force the INT pin to clear by clearing and resetting the latch bit of the Configuration Register (0x01)
  I2C_Send1(slaveAddress, 0x01);   // pointer register 0x01 = Configuration Register
  config = I2C_Recv2(slaveAddress);// current Configuration Register
  I2C_Send3(slaveAddress, 0x01, (config&0xFF00)>>8, (config&0x00FF)&~0x0010);
  I2C_Send3(slaveAddress, 0x01, (config&0xFF00)>>8, (config&0x00FF)|0x0010);
  return (1<<(raw>>12))*(raw&0x0FFF);
}*/

// ------------BSP_LightSensor_Input------------
// Query the OPT3001 light sensor for a measurement.
// Wait until the measurement is ready, which may
// take 800 ms.
// Input: none
// Output: light intensity (units 100*lux)
// Assumes: BSP_LightSensor_Init() has been called
#define LIGHTINT  (*((volatile uint8_t *)(0x42000000+32*0x4C21+4*6)))  /* Port 4.6 Input */
int LightBusy = 0;                 // 0 = idle; 1 = measuring
uint32_t LightStart;               // system time when light sensor started (usec)
uint32_t LightCalls = 0;           // number of complete light measurements
#define LIGHTSAMPLETIME 800000     // number of 1 usec system time cycles needed to sample light sensor
uint32_t BSP_LightSensor_Input(void){
  uint32_t light;
  LightBusy = 1;
/*  lightsensorstart(0x44);
  while(LIGHTINT == 0x01){};       // wait for conversion to complete
  light = lightsensorend(0x44);*/
// stand alone section
  LightStart = BSP_Time_Get();
  while((BSP_Time_Get() - LightStart) < LIGHTSAMPLETIME){};
  LightCalls = LightCalls + 1;
  light = 100*LightCalls;          // arbitrary return value
// end of stand alone section
  LightBusy = 0;
  return light;
}

// ------------BSP_LightSensor_Start------------
// Start a measurement using the OPT3001.
// If a measurement is currently in progress, return
// immediately.
// Input: none
// Output: none
// Assumes: BSP_LightSensor_Init() has been called
void BSP_LightSensor_Start(void){
  if(LightBusy == 0){
    // no measurement is in progress, so start one
    LightBusy = 1;
/*    lightsensorstart(0x44);*/
// stand alone section
    LightStart = BSP_Time_Get();
// end of stand alone section
  }
}

// ------------BSP_LightSensor_End------------
// Query the OPT3001 light sensor for a measurement.
// If no measurement is currently in progress, start
// one and return zero immediately.  If the measurement
// is not yet complete, return zero immediately.  If
// the measurement is complete, store the result in the
// pointer provided and return one.
// Input: light is pointer to store light intensity (units 100*lux)
// Output: one if measurement is ready and pointer is valid
//         zero if measurement is not ready and pointer unchanged
// Assumes: BSP_LightSensor_Init() has been called
int BSP_LightSensor_End(uint32_t *light){
  uint32_t lightLocal;
  if(LightBusy == 0){
    // no measurement is in progress, so start one
    LightBusy = 1;
/*    lightsensorstart(0x44);*/
// stand alone section
    LightStart = BSP_Time_Get();
// end of stand alone section
    return 0;                      // measurement needs more time to complete
  } else{
    // measurement is in progress
/*    if(LIGHTINT == 0x01){*/
// stand alone section
    if((BSP_Time_Get() - LightStart) < LIGHTSAMPLETIME){
// end of stand alone section
      return 0;                    // measurement needs more time to complete
    } else{
/*      lightLocal = lightsensorend(0x44);*/
// stand alone section
      LightCalls = LightCalls + 1;
      lightLocal = 100*LightCalls; // arbitrary return value
// end of stand alone section
      *light = lightLocal;
      LightBusy = 0;
      return 1;                    // measurement is complete; pointer valid
    }
  }
}

// ------------BSP_TempSensor_Init------------
// Initialize a GPIO pin for input, which corresponds
// with BoosterPack pins J2.11 (Temperature Sensor
// interrupt).  Initialize two I2C pins, which
// correspond with BoosterPack pins J1.9 (SCL) and
// J1.10 (SDA).
// Input: none
// Output: none
void BSP_TempSensor_Init(void){
  i2cinit();
/*  P3SEL0 &= ~0x40;
  P3SEL1 &= ~0x40;                 // configure P3.6 as GPIO
  P3DIR &= ~0x40;                  // make P3.6 in
  P3REN &= ~0x40;                  // disable pull resistor on P3.6*/
}

