r-downing/edx-rtos-course-data-msp432/inc/BSPnotMKII.c
// Send the appropriate codes to initiate a
// measurement with a TMP006 temperature sensor at
// I2C slave address 'slaveAddress'.
// Assumes: BSP_TempSensor_Init() has been called
/*void static tempsensorstart(uint8_t slaveAddress){
  // configure Configuration Register (0x02) for:
  // 15    RST        software reset bit      0b = normal operation
  // 14-12 MOD        mode of operation     111b = sensor and die continuous conversion
  // 11-9  CR         ADC conversion rate   010b = 1 sample/sec
  // 8     EN         interrupt pin enable    1b = ~DRDY pin enabled (J2.11/P3.6)
  // 7     ~DRDY      data ready bit          0b (read only, automatic clear)
  // 6-0   reserved                      000000b (reserved)
  I2C_Send3(slaveAddress, 0x02, 0x75, 0x00);
}*/

// Send the appropriate codes to end a measurement
// with a TMP006 temperature sensor at I2C slave
// address 'slaveAddress'.  Store the results at the
// provided pointers.
// Assumes: BSP_TempSensor_Init() has been called and measurement is ready
/*void static tempsensorend(uint8_t slaveAddress, int32_t *sensorV, int32_t *localT){
  int16_t raw;
  I2C_Send1(slaveAddress, 0x00);   // pointer register 0x00 = Sensor Voltage Register
  raw = I2C_Recv2(slaveAddress);
  *sensorV = raw*15625;            // 156.25 nV per LSB
  I2C_Send1(slaveAddress, 0x01);   // pointer register 0x01 = Local Temperature Register
  raw = I2C_Recv2(slaveAddress);
  *localT = (raw>>2)*3125;         // 0.03125 C per LSB
}*/

// ------------BSP_TempSensor_Input------------
// Query the TMP006 temperature sensor for a
// measurement.  Wait until the measurement is ready,
// which may take 4 seconds.
// Input: sensorV is signed pointer to store sensor voltage (units 100*nV)
//        localT is signed pointer to store local temperature (units 100,000*C)
// Output: none
// Assumes: BSP_TempSensor_Init() has been called
#define TEMPINT   (*((volatile uint8_t *)(0x42000000+32*0x4C20+4*6)))  /* Port 3.6 Input */
int TempBusy = 0;                  // 0 = idle; 1 = measuring
uint32_t TempStart;                // system time when temperature sensor started (usec)
uint32_t TempCalls = 0;            // number of complete temperature measurements
#define TEMPSAMPLETIME 1000000     // number of 1 usec system time cycles needed to sample temperature sensor
void BSP_TempSensor_Input(int32_t *sensorV, int32_t *localT){
  int32_t volt, temp;
  TempBusy = 1;
/*  tempsensorstart(0x40);
  while(TEMPINT == 0x01){};        // wait for conversion to complete
  tempsensorend(0x40, &volt, &temp);*/
// stand alone section
  TempStart = BSP_Time_Get();
  while((BSP_Time_Get() - TempStart) < TEMPSAMPLETIME){};
  TempCalls = TempCalls + 1;
  volt = 10000*TempCalls;          // arbitrary return value
  temp = 10000*TempCalls;          // arbitrary return value
// end of stand alone section
  *sensorV = volt;
  *localT = temp;
  TempBusy = 0;
}

// ------------BSP_TempSensor_Start------------
// Start a measurement using the TMP006.
// If a measurement is currently in progress, return
// immediately.
// Input: none
// Output: none
// Assumes: BSP_TempSensor_Init() has been called
void BSP_TempSensor_Start(void){
  if(TempBusy == 0){
    // no measurement is in progress, so start one
    TempBusy = 1;
/*    tempsensorstart(0x40);*/
// stand alone section
    TempStart = BSP_Time_Get();
// end of stand alone section
  }
}

// ------------BSP_TempSensor_End------------
// Query the TMP006 temperature sensor for a
// measurement.  If no measurement is currently in
// progress, start one and return zero immediately.
// If the measurement is not yet complete, return
// zero immediately.  If the measurement is complete,
// store the result in the pointers provided and
// return one.
// Input: sensorV is signed pointer to store sensor voltage (units 100*nV)
//        localT is signed pointer to store local temperature (units 100,000*C)
// Output: one if measurement is ready and pointers are valid
//         zero if measurement is not ready and pointers unchanged
// Assumes: BSP_TempSensor_Init() has been called
int BSP_TempSensor_End(int32_t *sensorV, int32_t *localT){
  int32_t volt, temp;
  if(TempBusy == 0){
    // no measurement is in progress, so start one
    TempBusy = 1;
/*    tempsensorstart(0x40);*/
// stand alone section
    TempStart = BSP_Time_Get();
// end of stand alone section
    return 0;                      // measurement needs more time to complete
  } else{
    // measurement is in progress
/*    if(TEMPINT == 0x01){*/
// stand alone section
    if((BSP_Time_Get() - TempStart) < TEMPSAMPLETIME){
// end of stand alone section
      return 0;                    // measurement needs more time to complete
    } else{
/*      tempsensorend(0x40, &volt, &temp);*/
// stand alone section
      TempCalls = TempCalls + 1;
      volt = 10000*TempCalls;      // arbitrary return value
      temp = 10000*TempCalls;      // arbitrary return value
// end of stand alone section
      *sensorV = volt;
      *localT = temp;
      TempBusy = 0;
      return 1;                    // measurement is complete; pointers valid
    }
  }
}
